updated diagram to mermaid
